class Arabic {
  Map<String, String> dictionary = <String, String>{
    //////////////////////////////////////////
    //             login view             ////
    /////////////////////////////////////////
    'User ID': 'معرف المستخدم',
    'Password': 'كلمة المرور',
    'login': 'تسجيل الدخول',
    'logging': 'جاري تسجيل الدخول',
    'Forgot Password?':'نسيت كلمة المرور؟',
    'Remember me':'تذكرني',
    //////////////////////////////////////////
    //             main view             ////
    /////////////////////////////////////////
    'Notification':'التنبيهات',
    'Lecture\nTable':'جدول \n المحاضرات',
    'Home':'الرئيسية',
    'Reports':'التقارير',
    'Profile':'الملف الشخصي',
    'Assignments':'التكاليف',
    //////////////////////////////////////////
    //            profile tab view        ////
    /////////////////////////////////////////
    'Email':'البريد الالكتروني',
    'UserName':'اسم المستخدم',
    'Phone':'الجوال',
    'Language':'اللغة',
    'Logout':'تسجيل الخروج',
    'Academic Degree': 'الدرجة الاكادمية',
    'Administrative Position': 'المنصب الاداري',
    //////////////////////////////////////////
    //            home tab view           ////
    /////////////////////////////////////////
    'News':'الاخبار',
    'Services':'الخدمات',
    'Library':'المكتبة',
    'Lectures':'المحاضرات',
    'Payments':'الدفع',
    'Academic':'الاكاديمية',
    'Card':'البطاقة',
    'Student':'الطالب',
    'Degrees':'الدرجات',
    'Exam':'الاختبارات',
    'Schedule':'جدول',
    //////////////////////////////////////////
    //         lecture table tab view     ////
    /////////////////////////////////////////
    'Add Lecture': 'إضافة محاضرة',
    'Temporary Replace':'تبديل مؤقت',
    'Confirm':'تاكيد',
    'Cancel':'إلغاء',
    //////////////////////////////////////////
    //         Exam table tab view       ////
    /////////////////////////////////////////
    'Exams Table':'جدول الاختبارات',
    'Exams':'الاختبارات',
    'Add Exam': 'إضافة اختبار',
    //////////////////////////////////////////
    //       Notifications tab view       ////
    /////////////////////////////////////////
    'toDay': 'اليوم',
    'Day': 'اليوم',
    'Notifications': 'الإشعارات',
    //////////////////////////////////////////
    //       Assignments tab view       ////
    /////////////////////////////////////////
    'Add Attachments': 'إضافة ملحقات',
    'Show Students': 'عرض الطلاب',
    'Upload Assignment':'رفع التكليف',
    'Add Assignment':'إضافة تكليف',
    'Show Attachments': 'عرض الملحقات',
    'Due Date': 'موعد التسليم',

    //////////////////////////////////////////
    //               Days                 ////
    /////////////////////////////////////////
    'mon': 'الاثنين',
    'tue': 'الثلاثاء',
    'wed': 'الأربعاء',
    'thu': 'الخميس',
    'fri': 'الجمعة',
    'sat': 'السبت',
    'sun': 'الأحد',
    'Monday': 'الاثنين',
    'Tuesday': 'الثلاثاء',
    'Wednesday': 'الأربعاء',
    'Thursday': 'الخميس',
    'Friday': 'الجمعة',
    'Saturday': 'السبت',
    'Sunday': 'الأحد',
    //////////////////////////////////////////
    //             global                ////
    /////////////////////////////////////////
    'Hall':'القاعة',
    'Doctor':'الدكتور',
    'Dr':'د',
    'Subject':'المادة',
    'Unknown':'غير معروف',
    'Edit':'تعديل',
    'Delete':'حذف',
    'Add':'إضافة',
    'Close':'إغلاق',
    'Level':'المستوى',
    'Division':'الشعبة',
    'Section':'القسم',
    'Year':'السنة',
    'Term':'الفصل',
    'Time':'الوقت',
    'Date': 'التاريخ',
  };
}
