class Arabic {
  Map<String, String> dictionary = <String, String>{
    //////////////////////////////////////////
    //             login view             ////
    /////////////////////////////////////////
    'title': 'مرحبا',
    'studentid': 'معرف الطالب',
    'password': 'كلمة المرور',
    'login': 'تسجيل الدخول',
    'logging': 'جاري تسجيل الدخول',
    'forgotPassword?':'نسيت كلمة المرور؟',
    //////////////////////////////////////////
    //             main view             ////
    /////////////////////////////////////////
    'Notification':'التنبيهات',
    'Table':'الجدول',
    'Home':'الرئيسية',
    'Reports':'التقارير',
    'Profile':"الملف الشخصي",
    //////////////////////////////////////////
    //            profile tab view        ////
    /////////////////////////////////////////
    'Email':'البريد الالكتروني',
    'UserName':'اسم المستخدم',
    'Phone':'الجوال',
    'Language':'اللغة',
    'Level':'المستوى',
    'Division':'الشعبة',
    'Department':'القسم',
    'Logout':'تسجيل الخروج',
    //////////////////////////////////////////
    //            home tab view           ////
    /////////////////////////////////////////
    'News':'الاخبار',
    'Services':'الخدمات',
    'Library':'المكتبة',
    'Lectures':'المحاضرات',
    'Payments':'الدفع',
    'Academic':'الاكاديمية',
    'Card':'البطاقة',
    'Student':'الطالب',
    'Degrees':'الدرجات',
    'Exam':'الاختبارات',
    'Schedule':'جدول',
    //////////////////////////////////////////
    //            table tab view          ////
    /////////////////////////////////////////
    'mon': 'الاثنين',
    'tue': 'الثلاثاء',
    'wed': 'الأربعاء',
    'thu': 'الخميس',
    'fri': 'الجمعة',
    'sat': 'السبت',
    'sun': 'الأحد',
    'Monday': 'الاثنين',
    'Tuesday': 'الثلاثاء',
    'Wednesday': 'الأربعاء',
    'Thursday': 'الخميس',
    'Friday': 'الجمعة',
    'Saturday': 'السبت',
    'Sunday': 'الأحد',
    //////////////////////////////////////////
    //       Notifications tab view       ////
    /////////////////////////////////////////
    'toDay': 'اليوم',
    'Notifications': 'الإشعارات',
    //////////////////////////////////////////
    //             global                ////
    /////////////////////////////////////////
    'Unknown':'غير معروف',
  };
}
