class Arabic {
  Map<String, String> dictionary = <String, String>{
    //////////////////////////////////////////
    //             login view             ////
    /////////////////////////////////////////
    'User ID': 'معرف المستخدم',
    'Password': 'كلمة المرور',
    'login': 'تسجيل الدخول',
    'logging': 'جاري تسجيل الدخول',
    'Forgot Password?': 'نسيت كلمة المرور؟',
    'Remember me': 'تذكرني',
    //////////////////////////////////////////
    //             main view             ////
    /////////////////////////////////////////
    'Notification': 'التنبيهات',
    'Lecture\nTable': 'جدول \n المحاضرات',
    'Home': 'الرئيسية',
    'Reports': 'التقارير',
    'Profile': 'الملف الشخصي',
    'Assignments': 'التكاليف',
    //////////////////////////////////////////
    //            profile tab view        ////
    /////////////////////////////////////////
    'Email': 'البريد الالكتروني',
    'UserName': 'اسم المستخدم',
    'User Identifier':'معرف المستخدم',
    'Phone': 'الجوال',
    'Language': 'اللغة',
    'Logout': 'تسجيل الخروج',
    'Academic Degree': 'الدرجة الاكادمية',
    'Administrative Position': 'المنصب الاداري',
    'Change Password':'تغيير الرمز',
    'Old Password':'الرمز القديم',
    'New Password':'الرمز الجديد',
    'Password Confirmation':'التحقق من الرمز',
    'Confirmation':'التحقق',
    'Change':'تغيير',
    //////////////////////////////////////////
    //            home tab view           ////
    /////////////////////////////////////////
    'News': 'الاخبار',
    'Services': 'الخدمات',
    'Library': 'المكتبة',
    'Lectures': 'المحاضرات',
    'Payments': 'الدفع',
    'Academic': 'الاكاديمية',
    'Transactions':'المعاملات',
    'Academic Transactions':'المعاملات الاكاديمية',
    'Card': 'البطاقة',
    'Student': 'الطالب',
    'Degrees': 'الدرجات',
    'Exam': 'الاختبارات',
    'Schedule': 'جدول',
    'Settings':'الإعدادت',
    //////////////////////////////////////////
    //         lecture table tab view     ////
    /////////////////////////////////////////
    'Add Lecture': 'إضافة محاضرة',
    'Temporary Replace': 'تبديل مؤقت',
    'Confirm': 'تاكيد',
    'Cancel': 'إلغاء',
    'Search': 'بحث',
    //////////////////////////////////////////
    //         Exam table tab view       ////
    /////////////////////////////////////////
    'Exams Table': 'جدول الاختبارات',
    'Exams': 'الاختبارات',
    'Add Exam': 'إضافة اختبار',
    //////////////////////////////////////////
    //       Notifications tab view       ////
    /////////////////////////////////////////
    'toDay': 'اليوم',
    'Day': 'اليوم',
    'Notifications': 'الإشعارات',
    //////////////////////////////////////////
    //       Assignments tab view       ////
    /////////////////////////////////////////
    'Add Attachments': 'إضافة ملحقات',
    'Show Students': 'عرض الطلاب',
    'Upload Assignment': 'رفع التكليف',
    'Add Assignment': 'إضافة تكليف',
    'Show Attachments': 'عرض الملحقات',
    'Due Date': 'موعد التسليم',

    //////////////////////////////////////////
    //               Days                 ////
    /////////////////////////////////////////
    'mon': 'الاثنين',
    'tue': 'الثلاثاء',
    'wed': 'الأربعاء',
    'thu': 'الخميس',
    'fri': 'الجمعة',
    'sat': 'السبت',
    'sun': 'الأحد',
    'Monday': 'الاثنين',
    'Tuesday': 'الثلاثاء',
    'Wednesday': 'الأربعاء',
    'Thursday': 'الخميس',
    'Friday': 'الجمعة',
    'Saturday': 'السبت',
    'Sunday': 'الأحد',
    //////////////////////////////////////////
    //             global                ////
    /////////////////////////////////////////
    'Hall': 'القاعة',
    'Doctor': 'الدكتور',
    'Dr': 'د',
    'Subject': 'المادة',
    'Unknown': 'غير معروف',
    'Edit': 'تعديل',
    'Delete': 'حذف',
    'Upload': 'رفع',
    'Add': 'إضافة',
    'Close': 'إغلاق',
    'Level': 'المستوى',
    'Division': 'الشعبة',
    'Program': 'التخصص',
    'Year': 'السنة',
    'Semester': 'الفصل',
    'Time': 'الوقت',
    'Date': 'التاريخ',
    '2ec': 'الثاني',
    '1st': 'الأول'
  };
}
